app/views/bollywoods/show.html.erb

SELECT COUNT(*) FROM "bollywoods"
---

<% if Integer(@bollywood.Ques[1]) < Bollywood.count() %>