app/views/crickets/show.html.erb

SELECT COUNT(*) FROM "crickets"
---

<% if Integer(@cricket.Ques[1]) < Cricket.count() %>