app/views/footballs/show.html.erb


<% if Integer(@football.Ques[1]) < Football.count() %>
---
SELECT COUNT(*) FROM "footballs"