app/controllers/bollywoods_controller.rb

SELECT "bollywoods".* FROM "bollywoods"
---
  def index
    @bollywoods = Bollywood.all

SELECT  "bollywoods".* FROM "bollywoods" WHERE "bollywoods"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_bollywood
      @bollywood = Bollywood.find(params[:id])