app/controllers/crickets_controller.rb

SELECT "crickets".* FROM "crickets"
---
  def index
    @crickets = Cricket.all

INSERT INTO "crickets" ("Q_type", "Ques", "opt1", "opt2", "opt3", "opt4", "ans", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @cricket = Cricket.new(cricket_params)

    respond_to do |format|
      if @cricket.save

DELETE FROM "crickets" WHERE "crickets"."id" = ?  [["id", 1]]
---
  def destroy
    @cricket.destroy

SELECT  "crickets".* FROM "crickets" WHERE "crickets"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_cricket
      @cricket = Cricket.find(params[:id])