app/controllers/footballs_controller.rb

SELECT "footballs".* FROM "footballs"
---
  def index
    @footballs = Football.all

SELECT  "footballs".* FROM "footballs" WHERE "footballs"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_football
      @football = Football.find(params[:id])