app/controllers/hollywoods_controller.rb

SELECT "hollywoods".* FROM "hollywoods"
---
  def index
    @hollywoods = Hollywood.all

SELECT  "hollywoods".* FROM "hollywoods" WHERE "hollywoods"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_hollywood
      @hollywood = Hollywood.find(params[:id])